test_app/app/controllers/users_controller.rb

    def show
        @this_user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @new_user = User.new(user_params)
        if @new_user.save
---
INSERT INTO "users" ("first_name", "last_name", "age", "hometown", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "New"], ["last_name", "New"], ["age", 21], ["hometown", "New"], ["created_at", "2019-02-21 20:23:33.703926"], ["updated_at", "2019-02-21 20:23:33.703926"]]

    def update
        @this_user = User.find(params[:id])

        if @this_user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "age" = $3, "hometown" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["first_name", "kenny"], ["last_name", ""], ["age", nil], ["hometown", ""], ["updated_at", "2019-02-23 21:03:55.535570"], ["id", 2]]

    def destroy
        @this_user = User.find(params[:id])

        if @this_user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]